path = "lab_3/12.csv"

regex_patterns = {
    "telephone": "^\\+7-\\(9\\d{2}\\)-\\d{3}-\\d{2}-\\d{2}$",
    "height": "^[1-2]\\.\\d{2}$",
    "snils": "^\\d{11}$",
    "identifier": "^\\d{2}\\-\\d{2}\\/\\d{2}$",
    "occupation": "^[а-яА-Яa-zA-ZёЁ\\s-]+$",
    "longitude": "^-?(180(\\.0+)?|1[0-7]\\d(\\.\\d+)?|[1-9]?\\d(\\.\\d+)?)$",
    "blood_type": "^(A|B|AB|O)[+−]$",
    "issn": "^\\d{4}-\\d{4}$",
    "locale_code": "^[a-zA-Z]+(-[a-zA-Z]+)*$",
    "date": "^\\d{4}-(0[1-9]|1[0-2])-(0[1-9]|1\\d{1}|2\\d{1}|3[01])$"
}